LoadTesting/scripts/getAnnotationsForUserBook_Paged_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 130.316ms, rate sampling interval: 414ms
  Thread calibration: mean lat.: 144.860ms, rate sampling interval: 598ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   194.04ms  151.41ms   1.66s    89.45%
    Req/Sec   375.38    511.76     1.46k    75.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  169.47ms
 75.000%  231.29ms
 90.000%  305.15ms
 99.000%  986.62ms
 99.900%    1.45s 
 99.990%    1.64s 
 99.999%    1.65s 
100.000%    1.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.267     0.000000            1         1.00
      70.207     0.100000        21663         1.11
     100.607     0.200000        43320         1.25
     124.799     0.300000        65008         1.43
     147.967     0.400000        86758         1.67
     169.471     0.500000       108375         2.00
     180.735     0.550000       119197         2.22
     191.871     0.600000       130041         2.50
     203.775     0.650000       140796         2.86
     217.087     0.700000       151626         3.33
     231.295     0.750000       162504         4.00
     239.615     0.775000       167898         4.44
     248.703     0.800000       173274         5.00
     259.199     0.825000       178724         5.71
     271.871     0.850000       184171         6.67
     286.719     0.875000       189587         8.00
     295.167     0.887500       192254         8.89
     305.151     0.900000       194972        10.00
     316.671     0.912500       197671        11.43
     331.775     0.925000       200358        13.33
     351.999     0.937500       203073        16.00
     364.031     0.943750       204409        17.78
     378.623     0.950000       205765        20.00
     397.567     0.956250       207124        22.86
     431.103     0.962500       208468        26.67
     472.831     0.968750       209829        32.00
     507.135     0.971875       210511        35.56
     560.127     0.975000       211177        40.00
     663.551     0.978125       211853        45.71
     742.911     0.981250       212529        53.33
     818.175     0.984375       213211        64.00
     871.423     0.985938       213546        71.11
     923.135     0.987500       213884        80.00
     965.631     0.989062       214229        91.43
    1000.959     0.990625       214570       106.67
    1032.703     0.992188       214899       128.00
    1050.623     0.992969       215072       142.22
    1076.223     0.993750       215243       160.00
    1101.823     0.994531       215407       182.86
    1125.375     0.995313       215576       213.33
    1156.095     0.996094       215747       256.00
    1170.431     0.996484       215829       284.44
    1191.935     0.996875       215920       320.00
    1216.511     0.997266       216001       365.71
    1239.039     0.997656       216086       426.67
    1258.495     0.998047       216169       512.00
    1277.951     0.998242       216216       568.89
    1297.407     0.998437       216253       640.00
    1318.911     0.998633       216297       731.43
    1338.367     0.998828       216337       853.33
    1449.983     0.999023       216381      1024.00
    1465.343     0.999121       216400      1137.78
    1509.375     0.999219       216423      1280.00
    1523.711     0.999316       216442      1462.86
    1543.167     0.999414       216464      1706.67
    1567.743     0.999512       216489      2048.00
    1575.935     0.999561       216497      2275.56
    1583.103     0.999609       216510      2560.00
    1590.271     0.999658       216517      2925.71
    1597.439     0.999707       216528      3413.33
    1614.847     0.999756       216540      4096.00
    1615.871     0.999780       216545      4551.11
    1620.991     0.999805       216552      5120.00
    1625.087     0.999829       216558      5851.43
    1628.159     0.999854       216561      6826.67
    1630.207     0.999878       216567      8192.00
    1630.207     0.999890       216567      9102.22
    1635.327     0.999902       216572     10240.00
    1635.327     0.999915       216572     11702.86
    1636.351     0.999927       216577     13653.33
    1636.351     0.999939       216577     16384.00
    1639.423     0.999945       216581     18204.44
    1639.423     0.999951       216581     20480.00
    1639.423     0.999957       216581     23405.71
    1643.519     0.999963       216583     27306.67
    1645.567     0.999969       216587     32768.00
    1645.567     0.999973       216587     36408.89
    1645.567     0.999976       216587     40960.00
    1645.567     0.999979       216587     46811.43
    1645.567     0.999982       216587     54613.33
    1645.567     0.999985       216587     65536.00
    1653.759     0.999986       216588     72817.78
    1653.759     0.999988       216588     81920.00
    1653.759     0.999989       216588     93622.86
    1658.879     0.999991       216590    109226.67
    1658.879     1.000000       216590          inf
#[Mean    =      194.036, StdDeviation   =      151.413]
#[Max     =     1657.856, Total count    =       216590]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  225117 requests in 5.00m, 41.01MB read
Requests/sec:    750.02
Transfer/sec:    139.90KB