LoadTesting/scripts/getAnnotationsForUserBook_Paged_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 165.078ms, rate sampling interval: 542ms
  Thread calibration: mean lat.: 211.191ms, rate sampling interval: 1041ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   218.64ms  185.58ms   1.68s    89.80%
    Req/Sec   376.14    409.94     1.61k    81.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  179.58ms
 75.000%  251.52ms
 90.000%  361.73ms
 99.000%    1.14s 
 99.900%    1.54s 
 99.990%    1.62s 
 99.999%    1.68s 
100.000%    1.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.839     0.000000            1         1.00
      73.407     0.100000        21759         1.11
     106.175     0.200000        43531         1.25
     131.455     0.300000        65282         1.43
     155.135     0.400000        87044         1.67
     179.583     0.500000       108717         2.00
     191.615     0.550000       119607         2.22
     204.543     0.600000       130467         2.50
     218.111     0.650000       141288         2.86
     232.959     0.700000       152172         3.33
     251.519     0.750000       163046         4.00
     262.399     0.775000       168530         4.44
     274.687     0.800000       173942         5.00
     287.743     0.825000       179393         5.71
     305.151     0.850000       184790         6.67
     327.423     0.875000       190205         8.00
     343.039     0.887500       192911         8.89
     361.727     0.900000       195638        10.00
     385.791     0.912500       198339        11.43
     419.327     0.925000       201062        13.33
     474.111     0.937500       203776        16.00
     512.511     0.943750       205130        17.78
     553.471     0.950000       206493        20.00
     593.407     0.956250       207848        22.86
     635.903     0.962500       209214        26.67
     687.103     0.968750       210562        32.00
     715.775     0.971875       211247        35.56
     751.615     0.975000       211920        40.00
     804.351     0.978125       212597        45.71
     881.151     0.981250       213278        53.33
     971.263     0.984375       213964        64.00
    1014.271     0.985938       214304        71.11
    1057.791     0.987500       214644        80.00
    1108.991     0.989062       214982        91.43
    1165.311     0.990625       215321       106.67
    1202.175     0.992188       215664       128.00
    1217.535     0.992969       215824       142.22
    1239.039     0.993750       215998       160.00
    1265.663     0.994531       216166       182.86
    1296.383     0.995313       216334       213.33
    1325.055     0.996094       216502       256.00
    1343.487     0.996484       216595       284.44
    1361.919     0.996875       216682       320.00
    1387.519     0.997266       216757       365.71
    1418.239     0.997656       216843       426.67
    1458.175     0.998047       216933       512.00
    1473.535     0.998242       216970       568.89
    1494.015     0.998437       217013       640.00
    1509.375     0.998633       217054       731.43
    1526.783     0.998828       217097       853.33
    1539.071     0.999023       217139      1024.00
    1545.215     0.999121       217163      1137.78
    1552.383     0.999219       217184      1280.00
    1558.527     0.999316       217204      1462.86
    1561.599     0.999414       217224      1706.67
    1569.791     0.999512       217251      2048.00
    1573.887     0.999561       217256      2275.56
    1575.935     0.999609       217267      2560.00
    1580.031     0.999658       217278      2925.71
    1583.103     0.999707       217289      3413.33
    1586.175     0.999756       217299      4096.00
    1591.295     0.999780       217310      4551.11
    1591.295     0.999805       217310      5120.00
    1593.343     0.999829       217314      5851.43
    1595.391     0.999854       217320      6826.67
    1599.487     0.999878       217325      8192.00
    1603.583     0.999890       217328      9102.22
    1616.895     0.999902       217332     10240.00
    1676.287     0.999915       217351     11702.86
    1676.287     1.000000       217351          inf
#[Mean    =      218.641, StdDeviation   =      185.575]
#[Max     =     1675.264, Total count    =       217351]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  225131 requests in 5.00m, 41.01MB read
Requests/sec:    750.09
Transfer/sec:    139.91KB