LoadTesting/scripts/getAnnotationsForUser_All_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 6332.905ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 6114.268ms, rate sampling interval: 16793ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.34m     1.40m    4.62m    55.73%
    Req/Sec     8.76      3.22    20.00     93.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.47m 
 75.000%    3.58m 
 90.000%    4.15m 
 99.000%    4.57m 
 99.900%    4.62m 
 99.990%    4.62m 
 99.999%    4.62m 
100.000%    4.62m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9093.119     0.000000            1         1.00
   19791.871     0.100000          537         1.11
   41123.839     0.200000         1074         1.25
   80936.959     0.300000         1611         1.43
  116064.255     0.400000         2148         1.67
  148373.503     0.500000         2686         2.00
  163184.639     0.550000         2954         2.22
  176553.983     0.600000         3223         2.50
  188874.751     0.650000         3491         2.86
  202768.383     0.700000         3762         3.33
  214958.079     0.750000         4030         4.00
  220200.959     0.775000         4163         4.44
  224919.551     0.800000         4298         5.00
  230555.647     0.825000         4430         5.71
  236847.103     0.850000         4564         6.67
  243400.703     0.875000         4701         8.00
  246153.215     0.887500         4766         8.89
  248905.727     0.900000         4837        10.00
  252575.743     0.912500         4900        11.43
  256507.903     0.925000         4970        13.33
  259915.775     0.937500         5037        16.00
  261488.639     0.943750         5067        17.78
  263323.647     0.950000         5101        20.00
  264634.367     0.956250         5135        22.86
  266731.519     0.962500         5169        26.67
  268173.311     0.968750         5202        32.00
  268697.599     0.971875         5221        35.56
  269484.031     0.975000         5238        40.00
  270270.463     0.978125         5253        45.71
  271843.327     0.981250         5269        53.33
  272891.903     0.984375         5289        64.00
  273416.191     0.985938         5300        71.11
  273678.335     0.987500         5307        80.00
  273940.479     0.989062         5312        91.43
  274464.767     0.990625         5321       106.67
  274726.911     0.992188         5329       128.00
  274989.055     0.992969         5334       142.22
  275251.199     0.993750         5336       160.00
  275775.487     0.994531         5347       182.86
  275775.487     0.995313         5347       213.33
  276037.631     0.996094         5349       256.00
  276299.775     0.996484         5351       284.44
  276561.919     0.996875         5355       320.00
  276561.919     0.997266         5355       365.71
  276824.063     0.997656         5361       426.67
  276824.063     0.998047         5361       512.00
  276824.063     0.998242         5361       568.89
  276824.063     0.998437         5361       640.00
  277086.207     0.998633         5363       731.43
  277086.207     0.998828         5363       853.33
  277348.351     0.999023         5369      1024.00
  277348.351     1.000000         5369          inf
#[Mean    =   140135.329, StdDeviation   =    83709.278]
#[Max     =   277086.208, Total count    =         5369]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5603 requests in 5.00m, 354.68MB read
  Socket errors: connect 0, read 0, write 0, timeout 25
Requests/sec:     18.69
Transfer/sec:      1.18MB